<?xml version="1.0" encoding="UTF-8"?>

<!-- This is an automatically generated file. -->
<Chapter Label="Chapter_Examples">
<Heading>Examples</Heading>

<P/>
 Several classes of examples of subgroups of <Math>\mathrm{Aut}(B_{d,k})</Math> that satisfy (C) and or (D) are constructed in <Cite Key="Tor20"/> and implemented in this section. For a given permutation group <Math>F\le S_{d}</Math>, there are always the three local actions <Math>\Gamma(F)</Math>, <Math>\Delta(F)</Math> and <Math>\Phi(F)</Math> on <Math>\mathrm{Aut}(B_{d,2})</Math> that project onto <Math>F</Math>. For some <Math>F</Math>, these are all distinct and yield all universal groups that have <Math>F</Math> as their <Math>1</Math>-local action, see <Cite Key="Tor20" Where="Theorem 3.32"/>. More examples arise in particular when either point stabilizers in <Math>F</Math> are not simple, <Math>F</Math> preserves a partition, or <Math>F</Math> is not perfect.
<Section Label="Chapter_Examples_Section_Discrete_groups">
<Heading>Discrete groups</Heading>

 Here, we implement the local actions <Math>\Gamma(F),\Delta(F)\le\mathrm{Aut}(B_{d,2})</Math>, both of which satisfy both (C) and (D), see <Cite Key="Tor20" Where="Section 3.4.1"/>.
<P/>
<ManSection Label="gamma">
<Heading>gamma</Heading>
  <Oper Arg="d,a" Name="gamma" Label="for d, a"/>
  <Oper Arg="l,d,a" Name="gamma" Label="for l, d, a"/>
  <Oper Arg="l,d,s,addr" Name="gamma" Label="for l, d, s, addr"/>
  <Oper Arg="d,k,aut,z" Name="gamma" Label="for d, k, aut, z"/>
 <Description>
<P/>
 <List>
	<Mark>for the arguments <A>d</A>, <A>a</A></Mark>
	<Item> 
		Returns: the automorphism <Math>\gamma(</Math><A>a</A><Math>)=(</Math><A>a</A><Math>,(</Math><A>a</A><Math>)_{\omega\in\Omega})\in\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math> and a permutation <A>a</A> <Math>\in S_d</Math>.
	</Item>
	<Mark>for the arguments <A>l</A>, <A>d</A>, <A>a</A></Mark>
	<Item>
		Returns: the automorphism <Math>\gamma^{l}(</Math><A>a</A><Math>)\in\mathrm{Aut}(B_{d,l})</Math> all of whose <Math>1</Math>-local actions are given by <A>a</A>.
<P/>
		The arguments of this method are a radius <A>l</A> <Math>\in\mathbb{N}</Math>, a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math> and a permutation <A>a</A> <Math>\in S_d</Math>.
	</Item>
	<Mark>for the arguments <A>l</A>, <A>d</A>, <A>s</A>, <A>addr</A></Mark>
	<Item>
		Returns: the automorphism of <Math>B_{d,k}</Math> whose <Math>1</Math>-local actions are given by <A>s</A> at vertices whose address has <A>addr</A> as a prefix and are trivial elsewhere.
<P/>
		The arguments of this method are a radius <A>l</A> <Math>\in\mathbb{N}</Math>, a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a permutation <A>s</A> <Math>\in S_d</Math> and an address <A>addr</A> of a vertex in <Math>B_{d,l}</Math> whose last entry is fixed by <A>s</A>.
	</Item>
	<Mark>for the arguments <A>d</A>, <A>k</A>, <A>aut</A>, <A>z</A></Mark>
	<Item>
		Returns: the automorphism <Math>\gamma_{z}(</Math><A>aut</A><Math>)=(</Math><A>aut</A><Math>,(</Math><A>z</A><Math>(</Math><A>aut</A><Math>,\omega))_{\omega\in\Omega})\in\mathrm{Aut}(B_{d,k+1})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a radius <A>k</A> <Math>\in\mathbb{N}</Math>, an automorphism <A>aut</A> of <Math>B_{d,k}</Math>, and an involutive compatibility cocycle <A>z</A> of a subgroup of <Math>\mathrm{Aut}(B_{d,k})</Math> that contains <A>aut</A> (see <Ref Func="InvolutiveCompatibilityCocycle"/>).
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> gamma(3,(1,2));
(1,3)(2,4)(5,6)
]]></Example>


<P/>
<Example><![CDATA[
gap> gamma(2,3,(1,2));
(1,3)(2,4)(5,6)
gap> gamma(3,3,(1,2));
(1,5)(2,6)(3,8)(4,7)(9,11)(10,12)
]]></Example>


<P/>
<Example><![CDATA[
gap> gamma(3,3,(1,2),[1,3]);
(3,4)
gap> gamma(3,3,(1,2),[]);
(1,5)(2,6)(3,8)(4,7)(9,11)(10,12)
]]></Example>


<P/>
<Example><![CDATA[
gap> S3:=SymmetricGroup(3);;
gap> z1:=AllInvolutiveCompatibilityCocycles(3,1,S3)[1];;
gap> gamma(3,1,(1,2),z1);
(1,4)(2,3)(5,6)
gap> z3:=AllInvolutiveCompatibilityCocycles(3,1,S3)[3];;
gap> gamma(3,1,(1,2),z3);
(1,3)(2,4)(5,6)
]]></Example>


<P/>
<ManSection Label="GAMMA">
<Heading>GAMMA</Heading>
  <Oper Arg="d,F" Name="GAMMA" Label="for d, F"/>
  <Oper Arg="l,d,F" Name="GAMMA" Label="for l, d, F"/>
  <Oper Arg="F,z" Name="GAMMA" Label="for F, z"/>
 <Description>
 <List>
	<Mark>for the arguments <A>d</A>, <A>F</A></Mark>
	<Item> 
		Returns: the local action <Math>\Gamma(</Math><A>F</A><Math>)=\{(a,(a)_{\omega})\mid a\in F\}\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, and a subgroup <A>F</A> of <Math>S_{d}</Math>.
	</Item>
	<Mark>for the arguments <A>l</A>, <A>d</A>, <A>F</A></Mark>
	<Item>
		Returns: the group <Math>\Gamma^{l}(</Math><A>F</A><Math>)\le\mathrm{Aut}(B_{d,l})</Math>.
<P/>
		The arguments of this method are a radius <A>l</A> <Math>\in\mathbb{N}</Math>, a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, and a subgroup <A>F</A> of <Math>S_d</Math>.
	</Item>
	<Mark>for the arguments <A>d</A>, <A>k</A>, <A>F</A>, <A>z</A></Mark>
	<Item>
		Returns: the group <Math>\Gamma_{z}(</Math><A>F</A><Math>)=\{(a,(</Math><A>z</A><Math>(a,\omega))_{\omega\in\Omega})\mid a\in</Math><A>F</A><Math>\}\le\mathrm{Aut}(B_{d,k+1})</Math>.
<P/>
		The arguments of this method are a local action <A>F</A> <Math>\le\mathrm{Aut}(B_{d,k})</Math> and an involutive compatibility cocycle <A>z</A> of <A>F</A> (see <Ref Func="InvolutiveCompatibilityCocycle"/>).
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> F:=TransitiveGroup(4,3);;
gap> GAMMA(4,F);
Group([ (1,5,9,10)(2,6,7,11)(3,4,8,12), (1,8)(2,7)(3,9)(4,5)(10,12) ])
]]></Example>


<P/>
<Example><![CDATA[
gap> GAMMA(3,SymmetricGroup(3));
Group([ (1,4,5)(2,3,6), (1,3)(2,4)(5,6) ])
gap> GAMMA(2,3,SymmetricGroup(3));
Group([ (1,4,5)(2,3,6), (1,3)(2,4)(5,6) ])
gap> GAMMA(3,3,SymmetricGroup(3));
Group([ (1,8,10)(2,7,9)(3,5,12)(4,6,11), (1,5)(2,6)(3,8)(4,7)(9,11)(10,12) ])
]]></Example>


<P/>
<Example><![CDATA[
gap> F:=SymmetricGroup(3);;
gap> rho:=SignHomomorphism(F);;
gap> H:=PI(2,3,F,rho,[1]);;
gap> z:=InvolutiveCompatibilityCocycle(3,2,H);;
gap> GAMMA(3,2,H,z);
Group([ (), (), (1,9)(2,10)(3,12)(4,11)(7,8), (1,10,3,11)(2,9,4,12)
  (5,8,6,7), (1,12,8)(2,11,7)(3,10,5)(4,9,6) ])
]]></Example>


<ManSection Label="DELTA">
<Heading>DELTA</Heading>
  <Oper Arg="d,F" Name="DELTA" Label="for d, F"/>
  <Oper Arg="d,F,C" Name="DELTA" Label="for d, F, C"/>
 <Description>
<P/>
 <List>
	<Mark>for the arguments <A>d</A>, <A>F</A></Mark>
	<Item> 
		Returns: the group <Math>\Delta(</Math><A>F</A><Math>)\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, and a <E>transitive</E> subgroup <A>F</A> of <Math>S_{d}</Math>.
	</Item>
	<Mark>for the arguments <A>d</A>, <A>F</A>, <A>C</A></Mark>
	<Item>
		Returns: the group <Math>\Delta(</Math><A>F</A><Math>,</Math><A>C</A><Math>)\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a <E>transitive</E> subgroup <A>F</A> of <Math>S_d</Math>, and a central subgroup <A>C</A> of the stabilizer <A>F</A><Math>_{1}</Math> of <Math>1</Math> in <A>F</A>.
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> F:=SymmetricGroup(3);;
gap> D:=DELTA(3,F);
Group([ (1,3,6)(2,4,5), (1,3)(2,4), (1,2)(3,4)(5,6) ])
gap> F1:=Stabilizer(F,1);;
gap> D1:=DELTA(3,F,F1);
Group([ (1,4,5)(2,3,6), (1,3)(2,4)(5,6), (1,2)(3,4)(5,6) ])
gap> D=D1;
false
gap> G:=AutB(3,2);;
gap> D^G=D1^G;
true
]]></Example>


<P/>
<Example><![CDATA[
gap> F:=PrimitiveGroup(5,3);
AGL(1, 5)
gap> F1:=Stabilizer(F,1);
Group([ (2,3,4,5) ])
gap> C:=Group((2,4)(3,5));
Group([ (2,4)(3,5) ])
gap> Index(F1,C);
2
gap> Index(DELTA(5,F,F1),DELTA(5,F,C));
2
]]></Example>


<P/>
</Section>


<Section Label="Chapter_Examples_Section_Maximal_extensions">
<Heading>Maximal extensions</Heading>

 For any <Math>F\le\mathrm{Aut}(B_{d,k})</Math> that satisfies (C), the group <Math>\Phi(F)\le\mathrm{Aut}(B_{d,k+1})</Math> is the maximal extension of <Math>F</Math> that satisfies (C) as well. It stems from the action of <Math>\mathrm{U}_{k}(F)</Math> on balls of radius <Math>k+1</Math> in <Math>T_{d}</Math>.
<P/>
<ManSection Label="PHI1">
<Heading>PHI</Heading>
  <Oper Arg="d,F" Name="PHI" Label="for d, F"/>
  <Oper Arg="F" Name="PHI" Label="for F"/>
  <Oper Arg="l,F" Name="PHI" Label="for l, F"/>
 <Description>
 <List>
	<Mark>for the arguments <A>d</A>, <A>F</A></Mark>
	<Item> 
		Returns: the group <Math>\Phi(</Math><A>F</A><Math>)=\{(a,(a_{\omega})_{\omega})\mid a\in </Math><A>F</A><Math>,\ \forall \omega\in\Omega:\ a_{\omega}\in C_{F}(a,\omega)\}\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math> and a permutation group <A>F</A> <Math>\le S_{d}</Math>.
	</Item>
	<Mark>for the arguments <A>d</A>, <A>k</A>, <A>F</A></Mark>
	<Item>
		Returns: the group <Math>\Phi_{k}(</Math><A>F</A><Math>)=\{(a,(a_{\omega})_{\omega})\mid a\in </Math><A>F</A><Math>,\ \forall \omega\in\Omega:\ a_{\omega}\in C_{F}(a,\omega)\}\le\mathrm{Aut}(B_{d,k+1})</Math>.
<P/>
		The argument of this method is a local action <A>F</A> <Math>\le\mathrm{Aut}(B_{d,k})</Math>.
	</Item>
	<Mark>for the arguments <A>l</A>, <A>d</A>, <A>k</A>, <A>F</A></Mark>
	<Item> 
		Returns: the group <Math>\Phi^{l}(</Math><A>F</A><Math>)=\Phi_{l-1}\circ\cdots\circ\Phi_{k+1}\circ\Phi_{k}(</Math><A>F</A><Math>)\le\mathrm{Aut}(B_{d,l})</Math>.
<P/>
		The arguments of this method are a radius <A>l</A> <Math>\in\mathbb{N}</Math> and a local action <A>F</A> <Math>\le\mathrm{Aut}(B_{d,k})</Math>.
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> PHI(3,SymmetricGroup(3));
Group([ (1,4,5)(2,3,6), (1,3)(2,4)(5,6), (1,2), (3,4), (5,6) ])
gap> last=AutB(3,2);
true
gap> PHI(3,AlternatingGroup(3));
Group([ (1,4,5)(2,3,6) ])
gap> last=GAMMA(3,AlternatingGroup(3));
true
]]></Example>


<P/>
<Example><![CDATA[
gap> S3:=SymmetricGroup(3);;
gap> groups:=ConjugacyClassRepsCompatibleSubgroupsWithProjection(3,2,1,S3);
[ Group([ (1,2)(3,5)(4,6), (1,4,5)(2,3,6) ]), 
  Group([ (1,2)(3,4)(5,6), (1,2)(3,5)(4,6), (1,4,5)(2,3,6) ]), 
  Group([ (3,4)(5,6), (1,2)(3,4), (1,4,5)(2,3,6), (3,5,4,6) ]), 
  Group([ (3,4)(5,6), (1,2)(3,4), (1,4,5)(2,3,6), (3,5)(4,6) ]), 
  Group([ (3,4)(5,6), (1,2)(3,4), (1,4,5)(2,3,6), (5,6), (3,5,4,6) ]) ]
gap> for G in groups do Print(Size(G),",",Size(PHI(3,2,G)),"\n"); od;
6,6
12,12
24,192
24,192
48,3072
]]></Example>


<P/>
<Example><![CDATA[
gap> PHI(3,4,1,SymmetricGroup(4));
<permutation group with 34 generators>
gap> last=AutB(4,3);
true
]]></Example>


<P/>
<Example><![CDATA[
gap> rho:=SignHomomorphism(SymmetricGroup(3));;
gap> F:=PI(2,3,SymmetricGroup(3),rho,[1]);; Size(F);
24
gap> P:=PHI(4,3,2,F);; Size(P);
12288
gap> IsSubgroup(AutB(3,4),P);
true
gap> IsCompatible(3,4,P);
true
]]></Example>


<P/>
</Section>


<Section Label="Chapter_Examples_Section_Normal_subgroups_and_partitions">
<Heading>Normal subgroups and partitions</Heading>

 When point stabilizers in <Math>F\le S_{d}</Math> are not simple, or <Math>F</Math> preserves a partition, more universal groups can be constructed as follows.
<P/>
<ManSection Label="PHI2">
<Heading>PHI</Heading>
  <Oper Arg="d,F,N" Name="PHI" Label="for d, F, N"/>
  <Oper Arg="d,F,P" Name="PHI" Label="for d, F, P"/>
  <Oper Arg="F,P" Name="PHI" Label="for F, P"/>
 <Description>
<P/>
 <List>
	<Mark>for the arguments <A>d</A>, <A>F</A>, <A>N</A></Mark>
	<Item>
		Returns: the group <Math>\Phi(</Math><A>F</A><Math>,</Math><A>N</A><Math>)\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a <E>transitive</E> permutation group <A>F</A> <Math>\le S_{d}</Math> and a normal subgroup <A>N</A> of the stabilizer <A>F</A><Math>_{1}</Math> of <Math>1</Math> in <A>F</A>. 
	</Item>
	<Mark>for the arguments <A>d</A>, <A>F</A>, <A>P</A></Mark>
	<Item> 
		Returns: the group <Math>\Phi(</Math><A>F</A><Math>,</Math><A>P</A><Math>)=\{(a,(a_{\omega})_{\omega})\mid a\in </Math><A>F</A><Math>,\ a_{\omega}\in C_{F}(a,\omega)</Math> constant w.r.t. <A>P</A><Math>\}\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math> and a permutation group <A>F</A> <Math>\le S_{d}</Math> and a partition <A>P</A> of <C>[1..d]</C> preserved by <A>F</A>.
	</Item>
	<Mark>for the arguments <A>d</A>, <A>k</A>, <A>F</A>, <A>P</A></Mark>
	<Item>
		Returns: the group <Math>\Phi_{k}(</Math><A>F</A><Math>,</Math><A>P</A><Math>)=\{(\alpha,(\alpha_{\omega})_{\omega})\mid \alpha\in <A>F</A>,\ \alpha_{\omega}\in C_{F}(\alpha,\omega)</Math> constant w.r.t. <A>P</A><Math>\}\le\mathrm{Aut}(B_{d,k+1})</Math>.
<P/>
		The arguments of this method are a local action <A>F</A> <Math>\le\mathrm{Aut}(B_{d,k})</Math> and a partition <A>P</A> of <C>[1..d]</C> preserverd by <Math>\pi</Math><A>F</A> <Math>\le S_{d}</Math>. This method assumes that all compatibility sets with respect to a partition element are non-empty and that all compatibility sets of the identity with respect to a partition element are non-trivial.
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> F:=SymmetricGroup(4);;
gap> F1:=Stabilizer(P,1);
Sym( [ 2 .. 4 ] )
gap> grps:=NormalSubgroups(F1);
[ Sym( [ 2 .. 4 ] ), Alt( [ 2 .. 4 ] ), Group(()) ]
gap> N:=grps[2];
Alt( [ 2 .. 4 ] )
gap> PHI(4,F,N);
Group([ (1,5,9,10)(2,6,7,11)(3,4,8,12), (1,4)(2,5)(3,6)(7,8)(10,11), 
  (1,2,3) ])
gap> Index(F1,N);
2
gap> Index(PHI(4,F,F1),PHI(4,F,N));
16
]]></Example>


<P/>
<Example><![CDATA[
gap> F:=TransitiveGroup(4,3);
D(4)
gap> P:=Blocks(F,[1..4]);
[ [ 1, 3 ], [ 2, 4 ] ]
gap> G:=PHI(4,F,P);
Group([ (1,5,9,10)(2,6,7,11)(3,4,8,12), (1,8)(2,7)(3,9)(4,5)(10,12), (1,3)
  (8,9), (4,5)(10,12) ])
gap> aut:=Random(G);
(1,5,9,10)(2,6,7,11)(3,4,8,12)
gap> LocalAction(1,4,2,a,[1]); LocalAction(1,4,2,a,[3]);
(1,2,3,4)
(1,2,3,4)
gap> LocalAction(1,4,2,a,[2]); LocalAction(1,4,2,a,[4]);
(1,4)(2,3)
(1,4)(2,3)
]]></Example>


<P/>
<Example><![CDATA[
gap> H:=TransitiveGroup(4,3);
D(4)
gap> P:=Blocks(H,[1..4]);
[ [ 1, 3 ], [ 2, 4 ] ]
gap> F:=PHI(4,H,P);;
gap> G:=PHI(4,2,F,P);
<permutation group with 5 generators>
gap> IsCompatible(4,3,G);
true
]]></Example>


<P/>
</Section>


<Section Label="Chapter_Examples_Section_Abelian_quotients">
<Heading>Abelian quotients</Heading>

 When a permutation group <Math>F\le S_{d}</Math> is not perfect, i.e. it admits an abelian quotient <Math>\rho:F\twoheadrightarrow A</Math>, more universal groups can be constructed by imposing restrictions of the form <Math>\prod_{r\in R}\prod_{x\in S(b,r)}\rho(\sigma_{1}(\alpha,x))=1</Math> on elements <Math>\alpha\in\Phi^{k}(F)\le\mathrm{Aut}(B_{d,k})</Math>.
<P/>
<ManSection>
  <Func Arg="F" Name="SignHomomorphism" />
 <Returns> the sign homomorphism from <A>F</A> to <Math>S_{2}</Math>.
 
 
</Returns>
 <Description>
 The argument of this method is a permutation group <A>F</A> <Math>\le S_{d}</Math>. This method can be used as an example for the argument <A>rho</A> in the methods <Ref Func="SpheresProduct"/> and <Ref Func="PI"/>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> F:=SymmetricGroup(3);;
gap> sign:=SignHomomorphism(F);
MappingByFunction( Sym( [ 1 .. 3 ] ), Sym( [ 1 .. 2 ] ), function( g ) ... end )
gap> Image(sign,(2,3));
(1,2)
gap> Image(sign,(1,2,3));
()
]]></Example>


<ManSection>
  <Func Arg="F" Name="AbelianizationHomomorphism" />
 <Returns> the homomorphism from <A>F</A> to <Math>F/[F,F]</Math>.
 
 
</Returns>
 <Description>
 The argument of this method is a permutation group <A>F</A> <Math>\le S_{d}</Math>. This method can be used as an example for the argument <A>rho</A> in the methods <Ref Func="SpheresProduct"/> and <Ref Func="PI"/>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> F:=PrimitiveGroup(5,3);
AGL(1, 5)
gap> ab:=AbelianizationHomomorphism(PrimitiveGroup(5,3));
[ (2,3,4,5), (1,2,3,5,4) ] -> [ f1, <identity> of ... ]
gap> Elements(Range(ab));
[ <identity> of ..., f1, f2, f1*f2 ]
gap> StructureDescription(Range(ab));
"C4"
]]></Example>


<ManSection>
  <Func Arg="d,k,aut,rho,R" Name="SpheresProduct" />
 <Returns> the product <Math>\prod_{r\in R}\prod_{x\in S(b,r)}</Math><A>rho</A><Math>(\sigma_{1}(</Math><A>aut</A><Math>,x))\in\mathrm{im}(</Math><A>rho</A><Math>)</Math>.
 
 
</Returns>
 <Description>
 The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a radius <A>k</A> <Math>\in\mathbb{N}</Math>, an automorphism <A>aut</A> of <Math>B_{d,k}</Math> all of whose <Math>1</Math>-local actions are in the domain of the homomorphism <A>rho</A> from a subgroup of <Math>S_d</Math> to an abelian group, and a sublist <A>R</A> of <C>[0..k-1]</C>. This method is used in the implementation of <Ref Func="PI"/>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> rho:=SignHomomorphism(SymmetricGroup(3));;
gap> SpheresProduct(3,2,gamma(2,3,(1,2)),rho,[0]);
(1,2)
gap> SpheresProduct(3,2,gamma(2,3,(1,2)),rho,[0,1]);
()
]]></Example>


<P/>
<Example><![CDATA[
gap> F:=PrimitiveGroup(5,3);
AGL(1, 5)
gap> rho:=AbelianizationHomomorphism(F);;
gap> Elements(Range(rho));
[ <identity> of ..., f1, f2, f1*f2 ]
gap> StructureDescription(Range(rho));
"C4"
gap> aut:=Random(F);
(1,2,4,5)
gap> SpheresProduct(5,3,gamma(3,5,aut),rho,[2]);
<identity> of ...
gap> SpheresProduct(5,3,gamma(3,5,aut),rho,[1,2]);
f1*f2
gap> SpheresProduct(5,3,gamma(3,5,aut),rho,[0,1,2]);
f2
]]></Example>


<ManSection>
  <Func Arg="l,d,F,rho,R" Name="PI" />
 <Returns> the group <Math>\Pi^{l}(</Math><A>F</A><Math>,</Math><A>rho</A><Math>,</Math><A>R</A><Math>)=\{\alpha\in\Phi^{l}(F)\mid \prod_{r\in R}\prod_{x\in S(b,r)}</Math><A>rho</A><Math>(\sigma_{1}(\alpha,x))=1\}\le\mathrm{Aut}(B_{d,l})</Math>.
 
 
</Returns>
 <Description>
 The arguments of this method are a degree <A>l</A> <Math>\in\mathbb{N}_{\ge 2}</Math>, a radius <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a permutation group <A>F</A> <Math>\le S_d</Math>, a homomorphism <Math>\rho</Math> from <A>F</A> to an abelian group that is surjective on every point stabilizer in <A>F</A>, and a non-empty, non-zero subset <A>R</A> of <C>[0..l-1]</C> that contains <Math>l-1</Math>.
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> F:=PrimitiveGroup(5,3);
AGL(1, 5)
gap> rho1:=AbelianizationHomomorphism(F);;
gap> rho2:=SignHomomorphism(F);;
gap> PI(3,5,F,rho1,[0,1,2]);
<permutation group with 4 generators>
gap> Index(PHI(3,5,1,F),last);
4
gap> PI(3,5,F,rho2,[0,1,2]);
<permutation group with 6 generators>
gap> Index(PHI(3,5,1,F),last);
2
]]></Example>


</Section>


<Section Label="Chapter_Examples_Section_Semidirect_products">
<Heading>Semidirect products</Heading>

 When a subgroup <Math>F\le\mathrm{Aut}(B_{d,k})</Math> satisfies (C) and admits an involutive compatibility cocycle <Math>z</Math> (which is automatic when <Math>k=1</Math>) one can characterise the kernels <Math>K\le\Phi_{k}(F)\cap\ker(\pi_{k})</Math> that fit into a <Math>z</Math>-split exact sequence <Math>1\to K\to\Sigma(F,K)\to F\to 1</Math> for some subgroup <Math>\Sigma(F,K)\le\mathrm{Aut}(B_{d,k+1})</Math> that satisfies (C). This characterisation is implemented in this section.
<P/>
<ManSection Label="CompatibleKernels">
<Heading>CompatibleKernels</Heading>
  <Oper Arg="d,F" Name="CompatibleKernels" Label="for d, F"/>
  <Oper Arg="F,z" Name="CompatibleKernels" Label="for F, z"/>
 <Description>
<P/>
 <List>
	<Mark>for the arguments <A>d</A>, <A>F</A></Mark>
	<Item> 
		Returns: the list of kernels <Math>K\le\prod_{\omega\in\Omega}F_{\omega}\cong\ker\pi\le\mathrm{Aut}(B_{d,2})</Math> that are preserved by the action <A>F</A> <Math>\curvearrowright\prod_{\omega\in\Omega}F_{\omega}</Math>, <Math>a\cdot(a_{\omega})_{\omega}:=(aa_{a^{-1}\omega}a^{-1})_{\omega}</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, and a permutation group <A>F</A> <Math>\le S_{d}</Math>. The kernels output by this method are compatible with <A>F</A> with respect to the standard cocycle (see <Ref Func="InvolutiveCompatibilityCocycle"/>) and can be used in the method <Ref Oper="SIGMA"/>.
	</Item>
	<Mark>for the arguments <A>d</A>, <A>k</A>, <A>F</A>, <A>z</A></Mark>
	<Item>
		Returns: the list of kernels <Math>K\le\Phi_{k}(F)\cap\ker(\pi_{k})\le\mathrm{Aut}(B_{d,k+1})</Math> that are normalized by <Math>\Gamma_{z}(</Math><A>F</A><Math>)</Math> and such that for all <Math>k\in K</Math> and <Math>\omega\in\Omega</Math> there is <Math>k_{\omega}\in K</Math> with <Math>\mathrm{pr}_{\omega}k_{\omega}=z(\mathrm{pr}_{\omega}k,\omega)^{-1}</Math>.
<P/>
		The arguments of this method are a local action <A>F</A> <Math>\le\mathrm{Aut}(B_{d,k})</Math> that satisfies (C) and an involutive compatibility cocycle <A>z</A> of <A>F</A> (see <Ref Func="InvolutiveCompatibilityCocycle"/>). It can be used in the method <Ref Oper="SIGMA"/>.
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> CompatibleKernels(3,SymmetricGroup(3));
[ Group(()), Group([ (1,2)(3,4)(5,6) ]), Group([ (3,4)(5,6), (1,2)(5,6) ]), 
  Group([ (5,6), (3,4), (1,2) ]) ]
]]></Example>


<P/>
<Example><![CDATA[
gap> P:=SymmetricGroup(3);;
gap> rho:=SignHomomorphism(P);;
gap> F:=PI(2,3,P,rho,[1]);;
gap> z:=InvolutiveCompatibilityCocycle(3,2,F);;
[ Group(()), Group([ (1,2)(3,4)(5,6)(7,8)(9,10)(11,12) ]), 
  Group([ (1,2)(3,4)(5,6)(7,8), (5,6)(7,8)(9,10)(11,12) ]), 
  Group([ (5,6)(7,8), (1,2)(3,4), (9,10)(11,12) ]) ]
]]></Example>


<ManSection Label="SIGMA">
<Heading>SIGMA</Heading>
  <Oper Arg="d,F,K" Name="SIGMA" Label="for d, F, K"/>
  <Oper Arg="F,K,z" Name="SIGMA" Label="for F, K, z"/>
 <Description>
<P/>
 <List>
	<Mark>for the arguments <A>d</A>, <A>F</A>, <A>K</A></Mark>
	<Item> 
		Returns: the semidirect product <Math>\Sigma(</Math><A>F</A><Math>,</Math><A>K</A><Math>)\le\mathrm{Aut}(B_{d,2})</Math>.
<P/>
		The arguments of this method are a degree <A>d</A> <Math>\in\mathbb{N}_{\ge 3}</Math>, a subgroup <A>F</A> of <Math>S_{d}</Math> and a compatible kernel <A>K</A> for <A>F</A> (see <Ref Oper="CompatibleKernels"/>).
	</Item>
	<Mark>for the arguments <A>d</A>, <A>k</A>, <A>F</A>, <A>K</A>, <A>z</A></Mark>
	<Item>
		Returns: the semidirect product <Math>\Sigma_{z}(</Math><A>F</A><Math>,</Math><A>K</A><Math>)\le\mathrm{Aut}(B_{d,k+1})</Math>.
<P/>
		The arguments of this method are a local action <A>F</A> of <Math>\mathrm{Aut}(B_{d,k})</Math> that satisfies (C) and a kernel <A>K</A> that is compatible for <A>F</A> with respect to the involutive compatibility cocycle <A>z</A> (see <Ref Func="InvolutiveCompatibilityCocycle"/> and <Ref Oper="CompatibleKernels"/>) of <A>F</A>.
	</Item>
 </List>
<P/>
 </Description>
</ManSection>


<P/>
<Example><![CDATA[
gap> S3:=SymmetricGroup(3);;
gap> kernels:=CompatibleKernels(3,S3);
[ Group(()), Group([ (1,2)(3,4)(5,6) ]), Group([ (3,4)(5,6), (1,2)(5,6) ]), 
  Group([ (5,6), (3,4), (1,2) ]) ]
gap> for K in kernels do Print(Size(SIGMA(3,S3,K)),"\n"); od;
6
12
24
48
]]></Example>


<P/>
<Example><![CDATA[
gap> P:=SymmetricGroup(3);;
gap> rho:=SignHomomorphism(P);;
gap> F:=PI(2,3,P,rho,[1]);;
gap> z:=InvolutiveCompatibilityCocycle(3,2,F);;
gap> kernels:=CompatibleKernels(3,2,F,z);
[ Group(()), Group([ (1,2)(3,4)(5,6)(7,8)(9,10)(11,12) ]), 
  Group([ (1,2)(3,4)(5,6)(7,8), (5,6)(7,8)(9,10)(11,12) ]), 
  Group([ (5,6)(7,8), (1,2)(3,4), (9,10)(11,12) ]) ]
gap> for K in kernels do Print(Size(SIGMA(3,2,F,K,z)),"\n"); od;
24
48
96
192
]]></Example>


</Section>


</Chapter>

